sysbenchOutputs_small/results_27_500M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 27
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 25MiB each
500MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      328.35
    writes/s:                     218.95
    fsyncs/s:                     126.80

Throughput:
    read, MiB/s:                  5.13
    written, MiB/s:               3.42

General statistics:
    total time:                          30.3274s
    total number of events:              19906

Latency (ms):
         min:                                    0.00
         avg:                                   40.82
         max:                                  490.72
         95th percentile:                      292.60
         sum:                               812573.74

Threads fairness:
    events (avg/stddev):           737.2593/126.99
    execution time (avg/stddev):   30.0953/0.01