sysbenchOutputs_small/results_28_1G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 28
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 51.2MiB each
1024MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      329.53
    writes/s:                     219.85
    fsyncs/s:                     127.75

Throughput:
    read, MiB/s:                  5.15
    written, MiB/s:               3.43

General statistics:
    total time:                          30.3674s
    total number of events:              20005

Latency (ms):
         min:                                    0.01
         avg:                                   42.04
         max:                                  531.50
         95th percentile:                      308.84
         sum:                               841007.22

Threads fairness:
    events (avg/stddev):           714.4643/124.49
    execution time (avg/stddev):   30.0360/0.04