sysbenchOutputs_small/results_32_500M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 25MiB each
500MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      333.17
    writes/s:                     222.28
    fsyncs/s:                     131.67

Throughput:
    read, MiB/s:                  5.21
    written, MiB/s:               3.47

General statistics:
    total time:                          30.4223s
    total number of events:              20266

Latency (ms):
         min:                                    0.01
         avg:                                   47.62
         max:                                  628.35
         95th percentile:                      344.08
         sum:                               964978.40

Threads fairness:
    events (avg/stddev):           633.3125/81.70
    execution time (avg/stddev):   30.1556/0.03