sysbenchOutputs_small/results_33_1G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 33
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 51.2MiB each
1024MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      322.73
    writes/s:                     215.15
    fsyncs/s:                     129.06

Throughput:
    read, MiB/s:                  5.04
    written, MiB/s:               3.36

General statistics:
    total time:                          30.3005s
    total number of events:              19551

Latency (ms):
         min:                                    0.01
         avg:                                   50.86
         max:                                  719.38
         95th percentile:                      350.33
         sum:                               994299.28

Threads fairness:
    events (avg/stddev):           592.4545/53.10
    execution time (avg/stddev):   30.1303/0.01