sysbenchOutputs_small/results_36_1G.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 36
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 51.2MiB each
1024MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      329.19
    writes/s:                     219.51
    fsyncs/s:                     133.44

Throughput:
    read, MiB/s:                  5.14
    written, MiB/s:               3.43

General statistics:
    total time:                          30.2498s
    total number of events:              19917

Latency (ms):
         min:                                    0.01
         avg:                                   54.46
         max:                                  692.21
         95th percentile:                      350.33
         sum:                              1084717.30

Threads fairness:
    events (avg/stddev):           553.2500/53.78
    execution time (avg/stddev):   30.1310/0.05