sysbenchOutputs_small/results_39_500M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 39
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 25MiB each
500MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      340.19
    writes/s:                     226.79
    fsyncs/s:                     139.26

Throughput:
    read, MiB/s:                  5.32
    written, MiB/s:               3.54

General statistics:
    total time:                          30.1563s
    total number of events:              20520

Latency (ms):
         min:                                    0.00
         avg:                                   57.21
         max:                                  745.64
         95th percentile:                      363.18
         sum:                              1173990.71

Threads fairness:
    events (avg/stddev):           526.1538/67.21
    execution time (avg/stddev):   30.1023/0.03