sysbenchOutputs_small/results_5_100M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 5
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 5MiB each
100MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      305.00
    writes/s:                     203.33
    fsyncs/s:                     104.72

Throughput:
    read, MiB/s:                  4.77
    written, MiB/s:               3.18

General statistics:
    total time:                          30.0953s
    total number of events:              18352

Latency (ms):
         min:                                    0.00
         avg:                                    8.17
         max:                                  154.26
         95th percentile:                       57.87
         sum:                               149999.85

Threads fairness:
    events (avg/stddev):           3670.4000/203.85
    execution time (avg/stddev):   30.0000/0.00