sysbenchOutputs_small/results_8_500M.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: (none)
20 files, 25MiB each
500MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      303.49
    writes/s:                     202.16
    fsyncs/s:                     106.45

Throughput:
    read, MiB/s:                  4.74
    written, MiB/s:               3.16

General statistics:
    total time:                          30.0571s
    total number of events:              18240

Latency (ms):
         min:                                    0.00
         avg:                                   13.17
         max:                                  235.39
         95th percentile:                       92.42
         sum:                               240246.95

Threads fairness:
    events (avg/stddev):           2280.0000/225.15
    execution time (avg/stddev):   30.0309/0.02